<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\University;

class UniversitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $universities = [
            'جامعة القاهرة',
            'جامعة الأزهر',
            'جامعة عين شمس',
            'جامعة الإسكندرية',
            'جامعة أسيوط',
            'جامعة المنصورة',
            'جامعة طنطا',
            'جامعة الزقازيق',
            'جامعة حلوان',
            'جامعة المنوفية',
            'جامعة قناة السويس',
            'جامعة بنها',
            'جامعة الفيوم',
            'جامعة بني سويف',
            'جامعة المنيا',
            'جامعة جنوب الوادي',
            'جامعة أسوان',
            'جامعة السويس',
            'جامعة بورسعيد',
            'جامعة دمنهور',
            'جامعة كفر الشيخ',
            'جامعة سوهاج',
            'جامعة قنا',
            'جامعة الوادي الجديد',
            'جامعة مطروح',
            'جامعة العريش',
            'الجامعة الأمريكية بالقاهرة',
            'الجامعة الألمانية بالقاهرة',
            'جامعة النيل',
            'الجامعة البريطانية في مصر',
        ];

        foreach ($universities as $university) {
            University::create([
                'name' => $university,
            ]);
        }
    }
}
